app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? ORDER BY "articles"."id" ASC LIMIT 1  [["id", 3]]
---
  def show
    @article = Article.find(params[:id])

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 1]]
---
 def destroy
  	@articles = Article.find(params[:id])
  	@articles.destroy